# pandas Basics

- In this homework assignment, you will practice selecting, sorting, and aggregating data in a DataFrame. 
- Follow each *TODO* instruction to write a Python code snippet with pandas and Numpy. Include the output of each code cell.

In [2]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

**TODO 1**
Consider the following Python dictionary `adict`. 

```python
adict = {'state': ['New York', 'California', 'Maryland'], 
         'pop2010': [19378, 37254, 5774],
         'pop2018': [19542, 39557, 6043],
         'rev2010': [71545, 112372, 17064],
         'rev2018': [88541, 175017, 22427]}
```

Notation:

- `pop2010`: state's 2010 population (in thousand)
- `pop2018`: state's 2018 population (in thousand)
- `rev2010`: state's 2010 tax revenue (in million USD)
- `rev2018`: state's 2018 tax revenue (in million USD)

Construct a DataFrame `frame` from dictionary `adict`. The row label (index) of each state is its abbreviation, i.e., `NY`, `CA` or `MD`.

In [20]:
adict = {'state': ['New York', 'California', 'Maryland'], 
         'pop2010': [19378, 37254, 5774],
         'pop2018': [19542, 39557, 6043],
         'rev2010': [71545, 112372, 17064],
         'rev2018': [88541, 175017, 22427]}

In [23]:
#####TODO 1#####
pass
df=DataFrame(adict, index=['NY','CA','MD'])
df.head()

         state  pop2010  pop2018  rev2010  rev2018
NY    New York    19378    19542    71545    88541
CA  California    37254    39557   112372   175017
MD    Maryland     5774     6043    17064    22427

**TODO 2**
It is known that the areas of the three states are 54555, 163695 and 12406 square miles. Add a column `area` with appropriate data to DataFrame `frame`.

In [26]:
#####TODO 2#####
pass
df['Area']=[54555,163695,12406]
df.head()

         state  pop2010  pop2018  rev2010  rev2018    Area
NY    New York    19378    19542    71545    88541   54555
CA  California    37254    39557   112372   175017  163695
MD    Maryland     5774     6043    17064    22427   12406

**TODO 3** 
Select the first row and the last row of DataFrame `frame`.

In [28]:
#####TODO 3#####
pass
df1=df.loc[['NY','MD']]
df1.head()

       state  pop2010  pop2018  rev2010  rev2018   Area
NY  New York    19378    19542    71545    88541  54555
MD  Maryland     5774     6043    17064    22427  12406

**TODO 4**
Select just columns `state`, `pop2018` and `area` from DataFrame `frame`.

In [38]:
#####TODO 4#####
pass
df2 = df[['state','pop2018','Area']]
df2.head()

         state  pop2018    Area
NY    New York    19542   54555
CA  California    39557  163695
MD    Maryland     6043   12406

**TODO 5**
Select the New York state's population data in 2010 and 2018.

In [40]:
#####TODO 5#####
pass
df3=df.loc['NY',['pop2010','pop2018']]
df3.head()

pop2010    19378
pop2018    19542
Name: NY, dtype: object

**TODO 6**
Show the row labels of the second row and the third row.

In [45]:
#####TODO 6#####
pass
print(df.index[1],df.index[2])

CA MD

**TODO 7**
Select just columns `state`, `rev2010` and `rev2018` of the second row and the third row from DataFrame `frame`.

In [48]:
#####TODO 7#####
pass
df4=df.loc[[df.index[1],df.index[2]],['state','rev2010','rev2018']]
df4.head()

         state  rev2010  rev2018
CA  California   112372   175017
MD    Maryland    17064    22427

**TODO 8** Select only the rows from DataFrame `frame` with an area greater than 50,000.

In [49]:
#####TODO 8#####
pass
df5=df[df.Area>50000]
df5.head()

         state  pop2010  pop2018  rev2010  rev2018    Area
NY    New York    19378    19542    71545    88541   54555
CA  California    37254    39557   112372   175017  163695

**TODO 9** 
Add a column `popchange` to DataFrame `frame`. Assign the percentage change from 2010 to 2018 in each state's population to this new column.

In [50]:
#####TODO 9#####
pass
df['popchange']=((df.pop2018-df.pop2010)/df.pop2010)*100
df.head()

         state  pop2010  pop2018  rev2010  rev2018    Area  popchange
NY    New York    19378    19542    71545    88541   54555   0.846321
CA  California    37254    39557   112372   175017  163695   6.181887
MD    Maryland     5774     6043    17064    22427   12406   4.658815

**TODO 10** 
Sort DataFrame `frame` by the index.

In [51]:
#####TODO 10#####
pass
df=df.sort_index()
df.head()

         state  pop2010  pop2018  rev2010  rev2018    Area  popchange
CA  California    37254    39557   112372   175017  163695   6.181887
MD    Maryland     5774     6043    17064    22427   12406   4.658815
NY    New York    19378    19542    71545    88541   54555   0.846321

**TODO 11**
Sort DataFrame `frame` by the 2018 population in descending order.

In [53]:
#####TODO 11#####
pass
df=df.sort_values("pop2018",ascending=False)
df.head()

         state  pop2010  pop2018  rev2010  rev2018    Area  popchange
CA  California    37254    39557   112372   175017  163695   6.181887
NY    New York    19378    19542    71545    88541   54555   0.846321
MD    Maryland     5774     6043    17064    22427   12406   4.658815

**TODO 12**
Compute the total tax revenue across the three states in DataFrame `frame`.

In [54]:
####TODO 12####
pass
print("Total revenew in 2018: ",np.sum(df.rev2018))

Total revenew in 2018:  285985

**TODO 13** In how many states did the tax reveue increase by at least 30%?

In [55]:
#####TODO 13#####
pass
df[(((df.rev2018-df.rev2010)/df.rev2010)*100)>30]

         state  pop2010  pop2018  rev2010  rev2018    Area  popchange
CA  California    37254    39557   112372   175017  163695   6.181887
MD    Maryland     5774     6043    17064    22427   12406   4.658815

**TODO 14** 
Return the index of the row with the highest `popchange` value.

In [57]:
#####TODO 14#####
pass
df6=df.where(df.popchange==df.popchange.max())
df6.head()

         state  pop2010  pop2018   rev2010   rev2018      Area  popchange
CA  California  37254.0  39557.0  112372.0  175017.0  163695.0   6.181887
NY         NaN      NaN      NaN       NaN       NaN       NaN        NaN
MD         NaN      NaN      NaN       NaN       NaN       NaN        NaN

**TODO 15**
Replace Maryland's `popchange` value by `np.NaN`. Then count the number of rows in the DataFrame with one or more missing values.

Hint: use methods `isnull()` and `any(axis = 1)`.

In [63]:
#####TODO 15#####
pass
df6.loc['MD',['popchange']]=df6.loc['MD',['popchange']].replace(np.nan,0)
df6.head()

         state  pop2010  pop2018   rev2010   rev2018      Area  popchange
CA  California  37254.0  39557.0  112372.0  175017.0  163695.0   6.181887
NY         NaN      NaN      NaN       NaN       NaN       NaN        NaN
MD         NaN      NaN      NaN       NaN       NaN       NaN   0.000000

In [64]:
#count the number of rows in the DataFrame with one or more missing values.
sum(df6.isnull().any(axis=1))

2